sdaiPutADBValue(Sdai_ADBId*,SdaiPrimitiveType,BTEllipsis)
\details
Stores the value (or values) of a specified type to the attribute data block(ADB).
\param block      [in] An ADB instance.
\param valueType  [in] A value type.
\remarks
Possible error codes:
* sdaiSS_NOPN - Session is not open.
* sdaiAB_NEXS - ADB does not exist.
* sdaiVT_NVLD - Value type invalid.
* sdaiSY_ERR - Underlying system error.
\code
SdaiADB adbNominalValueEntityInstance141 = sdaiCreateEmptyADB();
...
sdaiPutADBValue(adbNominalValueEntityInstance141, sdaiREAL, 222.0);